----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 224, 224]           1,792
       BatchNorm2d-2         [-1, 64, 224, 224]             128
            Conv2d-3         [-1, 64, 224, 224]          36,928
       BatchNorm2d-4         [-1, 64, 224, 224]             128
         MaxPool2d-5         [-1, 64, 112, 112]               0
         Dropout2d-6         [-1, 64, 112, 112]               0
            Conv2d-7        [-1, 128, 112, 112]          73,856
       BatchNorm2d-8        [-1, 128, 112, 112]             256
            Conv2d-9        [-1, 128, 112, 112]         147,584
      BatchNorm2d-10        [-1, 128, 112, 112]             256
        MaxPool2d-11          [-1, 128, 56, 56]               0
        Dropout2d-12          [-1, 128, 56, 56]               0
           Conv2d-13          [-1, 256, 56, 56]         295,168
      BatchNorm2d-14          [-1, 256, 56, 56]             512
           Conv2d-15          [-1, 256, 56, 56]         590,080
      BatchNorm2d-16          [-1, 256, 56, 56]             512
        MaxPool2d-17          [-1, 256, 28, 28]               0
        Dropout2d-18          [-1, 256, 28, 28]               0
           Conv2d-19          [-1, 256, 28, 28]         590,080
      BatchNorm2d-20          [-1, 256, 28, 28]             512
        MaxPool2d-21          [-1, 256, 13, 13]               0
        Dropout2d-22          [-1, 256, 13, 13]               0
           Linear-23                  [-1, 256]      11,075,840
      BatchNorm1d-24                  [-1, 256]             512
        Dropout2d-25                  [-1, 256]               0
           Linear-26                  [-1, 153]          39,321
================================================================
Total params: 12,853,465
Trainable params: 12,853,465
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 196.67
Params size (MB): 49.03
Estimated Total Size (MB): 246.27
----------------------------------------------------------------